Converts a group of DetailCurves to equivalent ModelCurves.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public ModelCurveArray ConvertDetailToModelCurves(
	View view,
	DetailCurveArray detailCurves
)
  Visual Basic
Public Function ConvertDetailToModelCurves ( _
	view As View, _
	detailCurves As DetailCurveArray _
) As ModelCurveArray
  Visual C++
public:
ModelCurveArray^ ConvertDetailToModelCurves(
	View^ view,
	DetailCurveArray^ detailCurves
)
 Parameters
  view
 Type:  Autodesk.Revit.DB View
 The view where the new lines will be created. The lines are projected on the view workplane. The view workplane must be parallel to the view plane.
  detailCurves
 Type:  Autodesk.Revit.DB DetailCurveArray
 The detail curve array to be converted.
 Remarks
 This operation will create new ModelCurves with the same geometry of the original detail curves' geometry. The detail curves will be deleted from the document.
 Exceptions
  Exception  |   Condition
   System ArgumentNullException   |   Thrown when the input argument is    a null reference (  Nothing  in Visual Basic)  .
   System ArgumentException   |   Thrown when the given detail lines are not visible in the given view. Thrown when the detail lines are not in the same view or not parallel to the given view.
   System InvalidOperationException   |   Thrown when one or more curves could not be successfully converted.
 See Also
  Document Class
  Autodesk.Revit.DB Namespace